AppNameChangeFuncPtr
\details
Callback function providing ability for custom class to alter its application name
depending on file format version drawing is saved to.
\remarks
Effects only application name saved to file.